# Завдання 1
# Напишіть промпт для створення плану навчального
# курсу з певної теми для цільової айдиторії(початківці,
# професіонали, діти, тощо).
# Вхідні параметри: тема, опис цільової аудиторії
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot


import os
import dotenv

from langchain_google_genai import GoogleGenerativeAI
from langchain.prompts import PromptTemplate

dotenv.load_dotenv()
api_key = os.getenv("GEMINI_API_KEY")

llm = GoogleGenerativeAI(
    model="gemini-2.5-flash-lite",
    api_key=api_key,
)

zero_shot_prompt = PromptTemplate.from_template(
"""
Ти — експерт з розробки навчальних курсів.

Створи детальний план навчального курсу на основі таких вхідних даних:
- Тема курсу: {topic}
- Опис цільової аудиторії: {audience_description}

Вимоги:
- Розбий курс на модулі та уроки
- Починай з базових понять і поступово ускладнюй матеріал
- Для кожного модуля вкажи навчальну мету
- Додай практичні завдання або вправи
- Адаптуй стиль і складність матеріалу до цільової аудиторії
- Не додавай жодних пояснень або коментарів поза межами плану курсу
"""
)


few_shot_prompt = PromptTemplate.from_template("""
Ти — експерт з розробки навчальних курсів.

Приклад 1:
Тема: Програмування на Python
Цільова аудиторія: Початківці без технічного досвіду

План курсу:
Модуль 1: Вступ до програмування
- Що таке програмування
- Де використовується Python
- Встановлення Python і перша програма
Мета: Зрозуміти базові принципи програмування

Модуль 2: Змінні та типи даних
- Числа та рядки
- Оголошення змінних
- Просте введення та виведення даних
Мета: Навчитися зберігати та використовувати дані

---

Приклад 2:
Тема: Цифровий маркетинг
Цільова аудиторія: Власники малого бізнесу

План курсу:
Модуль 1: Основи цифрового маркетингу
- Що таке цифровий маркетинг
- Основні онлайн-канали
- Шлях клієнта
Мета: Зрозуміти ключові маркетингові поняття

Модуль 2: Маркетинг у соціальних мережах
- Вибір платформ
- Контент-стратегія
- Базова аналітика
Мета: Навчитися залучати клієнтів через соцмережі

---

Тепер створи детальний план навчального курсу на основі таких вхідних даних:
- Тема курсу: {topic}
- Опис цільової аудиторії: {audience_description}

Вимоги:
- Розбий курс на модулі та уроки
- Починай з базових понять і поступово ускладнюй матеріал
- Для кожного модуля вкажи навчальну мету
- Додай практичні завдання або вправи
- Адаптуй стиль і складність матеріалу до цільової аудиторії
- Не додавай жодних пояснень або коментарів поза межами плану курсу
)
""")

chain = zero_shot_prompt | llm #  few_shot_prompt  | llm

topic = input("Введіть тему курсу: ")
audience_description = input("Опишіть цільову аудиторію: ")

response = chain.invoke(
    {
        "topic": topic,
        "audience_description": audience_description
    }
)

print(response)


