# Завдання 1
# Створіть масив:
# 1 2 3 4
# 5 6 7 8
# 9 10 11 12
# 13 14 15 16
# Використовуючи індекси виведіть:
# ● число 14
# ● третій рядок
# ● перший стовпчик
# ● верхню половину
# ● замініть числа в рядках 2-3 на 100
# ● зробіть другий рядок таким як останній рядок
import numpy as np

array = np.array([
     [1, 2, 3, 4],
     [5, 6, 7, 8],
     [9, 10, 11, 12],
     [13, 14, 15, 16]
])
print(array[3, 1])
print()
print(array[2])
print()
print(array[0:4, 0])
print()
print(array[0:2, :])
print()
array[1:3, :] = 100
print(array)
print()
array[1, :] =  array[3, :]
print(array)


# Завдання 2
# У масиві з попереднього завдання створіть маску для
# парних чисел. З її допомогою
# ● виведіть самі числа
# ● замініть їх на 100
mask = array % 2 == 0
print(array[mask])

print()

array[mask] = 100
print(array)
print()

# Завдання 3
# Створіть 2 масиви типу uint8:
# Масив 1: 128 200 10
# Масив 2: 250 10 34
# Об’єднайте їх у пропорції 20% першого масив + 80%
# другого масиву. В результаті має бути тип даних uint8 та
# числа в діапазоні 0-255

array1 = np.array([128, 200, 10], dtype=np.uint8)
array2 = np.array([250, 10, 34], dtype=np.uint8)

res = 0.2 * array1 + 0.8 * array2
res = res.astype(np.uint8)

print(f'result: {res}')
print(f"Data type: {res.dtype}")